#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

//操作符

//算数操作符
//+ - * / %

//int main()
//{
//	int a = 3 / 5;//0.6
//	//整数除法，商0余3，展示商0
//	printf("%d\n", a);
//
//	float b = 6.0 / 5;
//	//除数和被除数有一个为小数形式
//	//float 类型只是将接受的数转化为浮点型
//	printf("%f\n", b);
//
//
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;//商2余1
//	//取模符号两端必须都是整数
//	printf("%d\n", a);
//	return 0;
//}



//移位操作符
//>> << 

//int main()
//{
//	int a = 2;
//
//	int b = a << 1;
//	//把a的二进制位向左移动一位
//	//00000000000000000000000000000010(2的二进制序列)
//	//向左移动一位 (左端0丢弃，右端空位补0)
//	//00000000000000000000000000000100(4的二进制序列)
//	printf("b = %d\n",b);
//	
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//
//	int b = a >> 1;
//	//a的二进制位向右移动1位
//	//00000000000000000000000000001010 (10的二进制序列)
//	//00000000000000000000000000000101 (5的二进制序列)
//	//向右移动一位(右端0丢弃，左端空位补)
//	
//	
//	//1.算术右移
//		//右边丢弃，左边补原符号位
//	//2.逻辑右移
//		//右边丢弃，左边补0
//
//	printf("b = %d\n", b);
//
//	return 0;
//}


//负数的移位

//int main()
//{
//	int a = -1;
//	//原码：10000000000000000000000000000001  (-1的二进制序列)
//	//反码：11111111111111111111111111111110
//	//补码：11111111111111111111111111111111  (内存中存的形式)
//	//当前的右移操作符使用的是算术右移(大部分)
//	
//	//整数的二进制表示形式有3种       <(针对负数)>
//	//原码：直接根据数值写出的二进制序列就是原码
//	//反码：原码的符号位不变，其他位按位取反就是反码
//	//补码：反码+1就是补码
//
//	int b = a >> 1;
//
//	printf("b = %d\n", b);
//	return 0;
//}


//位操作符:& | ^              (操作数都必须是整数)
//&按位与
//按位或
//按位异或



//按位与&

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//& - 按(2进制位)位与
//	int c = a & b;
//	printf("c = %d\n", c);
//
//	//00000000000000000000000000000011  (3的二进制序列)
//	//00000000000000000000000000000101  (5的二进制序列)
//	
//	//00000000000000000000000000000001  (结果)
//
//	return 0;
//}


//按位或|

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//| - 按(二进制位)位或
//	int c = a | b;//00000000000000000000000000000111
//
//	printf("c = %d\n", c);
//	return 0;
//}


//按位异或^

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//^ - 按(二进制位)位异或
//	int c = a ^ b;//00000000000000000000000000000110
//	//异或规则：相同为0，相异为1
//	printf("c = %d\n", c);
//	return 0;
//}


//不用第三个变量交换两个数

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换两个数
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	//数值太大可能溢出(int型变量有上限)
//	return 0;
//}


//异或的方法交换两个整数

//int main()
//{
//	int a = 3;//00000000000000000000000000000011
//	int b = 5;//00000000000000000000000000000101
//	printf("a = %d b = %d\n", a, b);
//	//a^a = 0;
//	//0^a = a;
//	a = a ^ b;//00000000000000000000000000000110  (6)
//	b = a ^ b;//00000000000000000000000000000011  (3)
//	//(a^b^b)
//	a = a ^ b;//00000000000000000000000000000101  (5)
//	//(a^b^a)
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}


//计算二进制序列中1的个数

//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//按位&上 00000000000000000000000000000001
//	//接着让a的二进制序列向右移动一位再按位与
//	//& >>
//	return 0;
//}



//将二进制序列中的某一位改变

//int main()
//{
//	int a = 13;
//	//第五位置成1
//	a = a | (1 << 4);
//	printf("%d\n", a);
//	//000000000000000000000000000 0 1101   (空出位置的0变为1)
//	//000000000000000000000000000 1 0000   (按位或上)
//	//000000000000000000000000000 1 1101   (结果)
//	
//	//1 << 4
//	//000000000000000000000000000 0 0001
//
//
//	//第五位置成0
//	a = a & ~(1 << 4);
//	printf("%d\n", a);
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//		//00000000000000000000000000010000的按位取反
//	return 0;
//}





//赋值操作符
//= += -= *= /= &/ ^= |= >>= <<=

//int main()
//{
//	int a = 10;
//	a = 100;
//	a = a + 100;
//	a += 100;
//	a = a >> 3;
//	return 0;
//}



//单目操作符 (a+b中的+有两个操作数，为双目操作符)
//! - + & sizeof ~ -- ++ * (类型)



//int main()
//{
//	int flag = 5;
//	if (flag)
//	{
//		printf("hehe\n");
//	}
//	if (!flag)
//	{
//		pritnf("haha\n");
//	}
//	return 0;
//}



//int main()
//{
//	int a = 10;
//	a = -a;
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	//int a = 10;
//	//char arr[10] = { 0 };
//	//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位是字节
//	//printf("%d\n", sizeof a);//括号可省略，即sizeof是操作符而不是函数
//	//printf("%d\n", sizeof(arr));//一个char大小是一个字节
//
//	short s = 5;//short类型大小2个字节
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));//2
//	//sizeof中表达式不参与运算
//	printf("%d\n", s);//5
//	return 0;
//}


////sizeof计算数组大小
//int main()
//{
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(arr));//计算的是数组的总大小 单位是字节
//	printf("%d\n", sizeof(arr[0]));//4
//	int sz = sizeof(arr) / sizeof(arr[0]);//计算元素个数
//	printf("%d\n", sz);
//
//	return 0;
//}


//~对一个数字的二进制位按位取反

//~按位取反

//int main()
//{
//	int a = 0;
//	printf("%d\n",~ a);
//	//按二进制位取反(把所有二进制中的数字),1变成0，0变成1
//	//整数在内存中存储的是补码
//	
//	//一个负整数的二进制表示有三种：原码 反码 补码
//	//-1的原码：10000000000000000000000000000001（第一个1为符号位，1代表负）
//	//按位取反：11111111111111111111111111111110（符号位不变）（反码）
//	//反码加1为补码：11111111111111111111111111111111
//
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	//对内存(补码)按位取反
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//
//	int b = ~a;
//	//~二进制位按位取反
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}



// ++ -- 

//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++(先使用后++)
//	int b = ++a;//前置++(先++后使用)
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}



//&  取地址

//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);//&a - 取地址操作符
//	int* pa = &a;//pa是用来存放地址的 - pa是一个指针变量
//	*pa = 20;//* 解引用操作符 - 间接访问操作符
//	printf("%d\n", a);
//	return 0;
//}


//&也是按位与，按位与时为双目操作符
//取地址为单目操作符


//int main()
//{
//	int a = (int)3.14;
//	//强制类型转换
//	return 0;
//}



//数组传参 传的是数组首元素的地址


//关系操作符
// > >= < <= != ==

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//if (a == b)
//	//if (a != b)
//	if(a < b)
//	{
//		
//	}
//	return 0;
//}



// = 赋值  == 判断相等

//字符串的比较有特定函数 strcmp()




//逻辑操作符
//&&（且）||（或）


//int main()
//{
//	int a = 3;
//	int b = 0;
//	if (a && b)
//	{
//
//	}
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//	//对于 && 操作符，左边为假，右边不算了
//	i = a++ || ++b || d++;
//	//对于 || 操作符，左边为真，右边不算了
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}



//条件操作符(三目操作符):三个操作数
//exp1?exp2:exp3
//exp1如果成立，exp2计算，整个表达式的结果是：exp2的结果
//exp1不成立，exp3计算，整个表达式的结果是：exp3的结果

//int main()
//{
//	int a = 3;
//	int b = 0;
//
//	/*if (a > 5)
//	{
//		b = 1;
//	}
//	else
//	{
//		b = -1;
//	}*/
//
//	//三目操作符
//
//	int b = a > 5 ? 1 : -1;
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 0;
//	int max = 0;
//	//求最大值
//	max = (a > b) ? a : b;
//	return 0;
//}



//逗号表达式
// 逗号隔开的一串表达式

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	int d = (c = 5, a = c + 3 ,b = a - 4 ,c += 5);
//	//逗号表达式从左向右依次计算(执行),但是整个表达式的结果是最后一个表达式的结果
//	printf("%d\n", d);
//	return 0;
//}

//int main()
//{
//	while (a = get_val(), count_val(a), a > 0)
//	{
//		//逗号表达式，避免代码冗余
//	}
//	return 0;
//}



//下标引用 函数调用和结构成员
//[] () . ->

//下标引用操作符[]

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//              0 1 2 3 4 5 6 7 8 9
//	printf("%d\n", arr[4]);//[] - 下标引用操作符
//	//[] 的操作数是arr和4
//	//双目操作符
//	
//	return 0;
//}




//函数调用操作符

//函数的定义

//int Add(int x, int y)
//{
//	return x + y;
//}
//
//void test()
//{
//
//}

//int main()
//{
//	int a = 10;
//	int b = 20;
//
//	//函数调用
//	int ret = Add(a,b);//() - 函数调用操作符
//	//操作数:Add,a,b
//	test();
//	return 0;
//}

//结构成员访问操作符
//.
//->


//结构体
//
//int float char short
//double long long long

//自定义类型
//书:书名，书号，定价
//人:名字，年龄，性别


//创建了一个自定义的类型

//struct Book
//{
//	char name[20];
//	char id[20];
//	int price;
//};


//int main()
//{
//	struct Book b = {"C语言","C20220322",55};
//	//printf("书名:%s\n", b.name);//.访问操作(结构体变量名.成员名)
//	//printf("书号:%s\n", b.id);
//	//printf("定价:%d\n", b.price);
//
//	struct Book* pb = &b;
//
//	/*printf("书名:%s\n", (*pb).name);
//	printf("书号:%s\n", (*pb).id);
//	printf("定价:%d\n", (*pb).price);*/
//
//	
//	printf("书名:%s\n", pb->name);//-> 指针指向成员(结构体指针->成员名)
//	printf("书号:%s\n", pb->id);
//	printf("定价:%d\n", pb->price);
//
//	return 0;
//}





//表达式求值

//整型提升
//表达式中的字符和短整型操作数在使用之前被转化为普通整型


//int main()
//{
//	char a, b, c;
//	a = b + c;
//	//b,c升为整型后运算，再被a截断
//	return 0;
//}

//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000000011
//	//00000011 = a
//	char b = 127;
//	//00000000000000000000000000001111111
//	//01111111 = b;
//
//	char c = a + b;
//	//a+b时整型提升
//	//a和b都没有达到int的大小，发生整型提升
//	//按照变量的数据类型的符号位来提升的
//	
//	//00000000000000000000000000000000011 - a
//	//00000000000000000000000000001111111 - b
//	
//	//00000000000000000000000000010000010 - c
//
//	//存入char类型
//	//10000010 - c
//
//	printf("%d\n", c);
//	//再次整型提升
//	//11111111111111111111111110000010 (补码)
//	//11111111111111111111111110000001 (反码) 补码-1
//	//10000000000000000000000001111110 (原码) 按位取反 (-126)
//
//	return 0;
//}



//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	printf("%u\n", sizeof(!c));//4   gcc
					//sizeof()返回无符号整型
//	//+c -c 推算参与运算后的类型大小，需要整型提升
//	return 0;
//}




//算术转换(向上转换)(向字节长的转换，向精度更高的转换)

//long double
//double
//float
//unsigned long int
//long int
//unsigned int
//int


//int main()
//{
//	int a = 4;
//	float f = 4.5f;
//	a + f;
//	return 0;
//}


//操作符的属性
	//1.操作符的优先级
	//2.操作符的结合性
	//3.操作符是否控制求值顺序

//int main()
//{
//	int a = 4;
//	int b = 5;
//	int c = a + b * 7;//优先级决定了计算顺序
//	int c = a + b + 7;//优先级不起作用，结合性决定顺序(L - R)
//	
//	//&& || ?: , (控制求值顺序)
//
//	return 0;
//}


//问题表达式
//无法形成确定准确的计算路径


//a * b + c * d + e * f


//c + --c


//非法表达式

//int fun()
//{
//	static int count = 1;
//	return ++count;
//}
//int main()
//{
//	int answer;
//	//2 - 3 * 4
//	answer = fun() - fun() * fun();
//	printf("%d\n", answer);
//	return 0;
//}



int main()
{
	int i = 1;
	int ret = (++i) + (++i) + (++i);
	printf("%d\n", ret);
	return 0;
}














